# Shell & Appearance
brew "zsh"
brew "starship"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Dev Tools
brew "git"
brew "ripgrep"
brew "gh"
brew "python@3.11"
brew "node"
brew "neovim"

# AI & Others
# brew "ollama" # 必要に応じて有効化

# macOS 専用アプリ (Casks)
on_macos do
  cask "iterm2"                # 高機能ターミナル
  cask "google-japanese-ime"   # Google 日本語入力
  cask "karabiner-elements"    # キーボードカスタマイズ
  cask "clipy"                 # クリップボード拡張
  cask "scroll-reverser"       # マウスホイール挙動の修正
end